paradigms.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-06 Sun 08:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kuhn's Paradigms in Technological Innovation</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="css/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Kuhn's Paradigms in Technological Innovation</h1>
<p>
A paradigm frames our experience of the world. A scientific paradigm structures which questions to ask, the interpretation of data, and the allocation of resources. Thomas Kuhn in 'The Structure of Scientific Revolutions' is largely credited with coining this modern usage of paradigm, providing a sweeping analysis of their lifecycle. Key for Kuhn is that science practice is shaped by a paradigm, until a paradigm shift, which reframes existing (and new) data and often provides a new set of questions.  While so accepted in science that it's taken for granted, what do paradigms look like in technology?
</p>

<p>
The easiest answer is to pull from the comparably-beloved text in innovation, Clayton Christensen's 'The Innovator's Dilemma'.  Here, innovations are classified as 'sustaining' which slightly improve an existing technology, and 'disruptive', a discontinuous change in capability and performance.  Christensen's core question - why are established firms not good at disruptive innovation - is partly answered by technology-specific factors, namely that established customers pull the resource allocation of technology companies towards existing use-cases, limiting investment in potential disruptive technologies by risk-adverse middle managers <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.  
</p>

<p>
That the shape of these processes is so similar &#x2013; incremental and creeping, then a discontinuous change &#x2013; is not a priori obvious given how different science and engineering are. However, at the core are decisions on resource allocation (at an individual and organizational level) and how intensive it is to do certain kinds of work. This comparison can be drawn out:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">What</th>
<th scope="col" class="org-left">Kuhn's paradigm</th>
<th scope="col" class="org-left">Christensen's innovation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Resource allocation (organization)</td>
<td class="org-left">What proposals to fund</td>
<td class="org-left">What dev projects to fund</td>
</tr>

<tr>
<td class="org-left">Resource allocation (individual)</td>
<td class="org-left">What experiments to do</td>
<td class="org-left">Where to invest time in project</td>
</tr>

<tr>
<td class="org-left">Evaluation</td>
<td class="org-left">Interpreting results, analysis methods</td>
<td class="org-left">Performance metrics</td>
</tr>

<tr>
<td class="org-left">Inertia (organizational)</td>
<td class="org-left">Peer review</td>
<td class="org-left">Existing customers</td>
</tr>

<tr>
<td class="org-left">Inertia (individual)</td>
<td class="org-left">Training, own previous work</td>
<td class="org-left">Existing development</td>
</tr>
</tbody>
</table>

<p>
In technological R&amp;D, the performance metric is critical for both internal evaluation and external communication. Comparing different designs, parameters, or solution concepts is most scalable and communicable when the performance is quantified. This metric is itself paradigmatic - tied to the current use-cases, customers, or research program. In robotics, the speed and accuracy of commercial robots was pushed up until the 2010s, when the soft robotics program was able to convince enough people that these criteria are not the limiting factor for many robotics applications (especially contact-rich tasks). 
</p>

<p>
The implicit question in both these works seems to be how can we support and accelerate these fundamental, disruptive innovations?  But there is a certain poetic beauty in the calcifying, inertial effects of a paradigm. If a person or organization seeks to change the world, and through great luck, opportunity, and effort, succeeds in establishing a new paradigm, this new paradigm is just one step - soon becoming the outdated relic, target of ambitious innovators.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Christensen, writing for managers, seems to pass over an obvious and practical factor: existing development base (with technical debt), with corresponding organizational inertia (development pipeline for the existing technology). 
</p></div></div>


</div>
</div></div>
</body>
</html>
